In [1]:
import pandas as pd

In [6]:
# membuat dataframe

people = {
    'firstname' : ['adi','asep', 'Ari','bukori'],
    'lastname' : ['saputra','aja','hidayat','muslim'],
    'age' : [21,22,23,24],
    'email' : ['adisaputra@gmail.com','asep@gmail.com','ariuchiha@gmail.com','bokor@gmail.com']
}

In [7]:
people

{'firstname': ['adi', 'asep', 'Ari', 'bukori'],
 'lastname': ['saputra', 'aja', 'hidayat', 'muslim'],
 'age': [21, 22, 23, 24],
 'email': ['adisaputra@gmail.com',
  'asep@gmail.com',
  'ariuchiha@gmail.com',
  'bokor@gmail.com']}

In [9]:
df = pd.DataFrame(people)

In [10]:
df

  firstname lastname  age                 email
0       adi  saputra   21  adisaputra@gmail.com
1      asep      aja   22        asep@gmail.com
2       Ari  hidayat   23   ariuchiha@gmail.com
3    bukori   muslim   24       bokor@gmail.com

In [11]:
df['email']

0    adisaputra@gmail.com
1          asep@gmail.com
2     ariuchiha@gmail.com
3         bokor@gmail.com
Name: email, dtype: object

In [17]:

# menggunakan fungsi iloc -> integer location

df.iloc[[0,3], [2,3]]

   age                 email
0   21  adisaputra@gmail.com
3   24       bokor@gmail.com

In [20]:
df.iloc[0:2, -4:-1]

  firstname lastname  age
0       adi  saputra   21
1      asep      aja   22

In [21]:

# menggunnakan fungsi loc aja -> slicing column berdasarkan nama columnn nya
df.loc[[1,2,3], 'age']

1    22
2    23
3    24
Name: age, dtype: int64

In [22]:
df.loc[0:3, ['lastname', 'email']]

  lastname                 email
0  saputra  adisaputra@gmail.com
1      aja        asep@gmail.com
2  hidayat   ariuchiha@gmail.com
3   muslim       bokor@gmail.com

In [23]:
df.loc[0:3, 'lastname':'email']

  lastname  age                 email
0  saputra   21  adisaputra@gmail.com
1      aja   22        asep@gmail.com
2  hidayat   23   ariuchiha@gmail.com
3   muslim   24       bokor@gmail.com

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   firstname  4 non-null      object
 1   lastname   4 non-null      object
 2   age        4 non-null      int64
 3   email      4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [25]:
df.count

<bound method DataFrame.count of   firstname lastname  age                 email
0       adi  saputra   21  adisaputra@gmail.com
1      asep      aja   22        asep@gmail.com
2       Ari  hidayat   23   ariuchiha@gmail.com
3    bukori   muslim   24       bokor@gmail.com>

In [26]:
df.mean()

/tmp/ipykernel_7378/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

age    22.5
dtype: float64

In [27]:
df.age.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    21
1    22
2    23
3    24
Name: age, dtype: int64>

In [28]:
df.describe()

             age
count   4.000000
mean   22.500000
std     1.290994
min    21.000000
25%    21.750000
50%    22.500000
75%    23.250000
max    24.000000

In [29]:
df.describe(include='O')

       firstname lastname                 email
count          4        4                     4
unique         4        4                     4
top          adi  saputra  adisaputra@gmail.com
freq           1        1                     1

In [31]:
df.age.sum()

90

In [32]:
sum(df['age'])

90

In [33]:
df.age.count()

4

<bound method NDFrame._add_numeric_operations.<locals>.std of   firstname lastname  age                 email
0       adi  saputra   21  adisaputra@gmail.com
1      asep      aja   22        asep@gmail.com
2       Ari  hidayat   23   ariuchiha@gmail.com
3    bukori   muslim   24       bokor@gmail.com>

In [36]:
df.age.min()

21